[
  {
    "data": {
      "date": "2019-04-24",
      "explanation": "The symmetric, multi-legged appearance of the Southern Crab Nebula is certainly distinctive. About 7,000 light-years distant toward the southern sky constellation Centaurus, its glowing nested hourglass shapes are produced by the remarkable symbiotic binary star system at its center. The nebula's dramatic stellar duo consists of a hot white dwarf star and cool, pulsating red giant star shedding outer layers that fall onto the smaller, much hotter companion. Embedded in a disk of material, outbursts from the white dwarf cause an outflow of gas driven away both above and below the disk resulting in the bipolar hourglass shapes. The bright central shape is about half a light-year across. This new Hubble Space Telescope image celebrates the 29th anniversary of Hubble's launch on April 24, 1990 on board the Space Shuttle Discovery.",
      "hdurl": "https://apod.nasa.gov/apod/image/1904/SouthernCrabHST_2100x2460.jpg",
      "media_type": "image",
      "service_version": "v1",
      "title": "The Shape of the Southern Crab",
      "url": "https://apod.nasa.gov/apod/image/1904/SouthernCrabHST_853x1000.jpg"
    },
    "status": "success",
    "errorThrown": ""
  },
  {
    "data": {
      "date": "2019-04-25",
      "explanation": "Ridges of glowing interstellar gas and dark dust clouds inhabit the turbulent, cosmic depths of the Lagoon Nebula. Also known as M8, the bright star forming region is about 5,000 light-years distant. But it still makes for a popular stop on telescopic tours of the constellation Sagittarius, toward the center of our Milky Way Galaxy. Dominated by the telltale red emission of ionized hydrogen atoms recombining with stripped electrons, this stunning view of the Lagoon is over 100 light-years across.  At its center, the bright, compact, hourglass shape is gas ionized and sculpted by energetic radiation and extreme stellar winds from a massive young star. In fact, the many bright stars of open cluster NGC 6530 drift within the nebula, just formed in the Lagoon several million years ago. Broadband image data from Pan-STARRS (Panoramic Survey Telescope & Rapid Response System) was combined with narrowband data from amateur telescopes to create this wide and deep portrait of the Lagoon Nebula.",
      "hdurl": "https://apod.nasa.gov/apod/image/1904/LagoonPanSTARRS_ColesPugh2048.jpg",
      "media_type": "image",
      "service_version": "v1",
      "title": "Pan-STARRS Across the Lagoon",
      "url": "https://apod.nasa.gov/apod/image/1904/LagoonPanSTARRS_ColesPugh1024.jpg"
    },
    "status": "success",
    "errorThrown": ""
  },
  {
    "data": {
      "copyright": "Carlos Fairbairn",
      "date": "2019-04-26",
      "explanation": "Tracking along the southern Milky Way this beautiful celestial mosaic was recorded under dark Brazilian skies. Spanning some 20 degrees it actually starts with the dark expanse of the Coalsack nebula at the lower left, tucked under an arm of the Southern Cross. That compact constellation is topped by bright yellowish Gamma Crucis, a cool giant star a mere 88 light-years distant. A line from Gamma Crucis through the blue star at the bottom of the cross, Alpha Crucis, points toward the South Celestial Pole. Follow the Milky Way to the right and your gaze will sweep across IC 2948, popularly known as the Running Chicken nebula, before it reaches Eta Carinae and the Carina Nebula near the right edge of the frame. About 200 light-years across, the Carina Nebula is a star forming region much larger than the more northerly stellar nursery the Orion Nebula. The Carina Nebula lies around 7,500 light-years from Earth along the plane of the Milky Way.",
      "hdurl": "https://apod.nasa.gov/apod/image/1904/FairbairnCROSSTOCARINA1024.jpg",
      "media_type": "image",
      "service_version": "v1",
      "title": "Southern Cross to Eta Carinae",
      "url": "https://apod.nasa.gov/apod/image/1904/FairbairnCROSSTOCARINA.jpg"
    },
    "status": "success",
    "errorThrown": ""
  },
  {
    "data": {
      "date": "2019-04-27",
      "explanation": "Bright elliptical galaxy Messier 87 (M87) is home to the supermassive black hole captured by planet Earth's Event Horizon Telescope in the first ever image of a black hole. Giant of the Virgo galaxy cluster about 55 million light-years away, M87 is the large galaxy rendered in blue hues in this infrared image from the Spitzer Space telescope.  Though M87 appears mostly featureless and cloud-like, the Spitzer image does record details of relativistic jets blasting from the galaxy's central region. Shown in the inset at top right, the jets themselves span thousands of light-years. The brighter jet seen on the right is approaching and close to our line of sight. Opposite, the shock created by the otherwise unseen receding jet lights up a fainter arc of material. Inset at bottom right, the historic black hole image is shown in context, at the center of giant galaxy and relativistic jets. Completely unresolved in the Spitzer image, the supermassive black hole surrounded by infalling material is the source of the enormous energy driving the relativistic jets from the center of active galaxy M87.",
      "hdurl": "https://apod.nasa.gov/apod/image/1904/pia23122c-16.jpg",
      "media_type": "image",
      "service_version": "v1",
      "title": "The Galaxy, the Jet, and the Black Hole",
      "url": "https://apod.nasa.gov/apod/image/1904/pia23122c-16_1067.jpg"
    },
    "status": "success",
    "errorThrown": ""
  },
  {
    "data": {
      "date": "2019-04-28",
      "explanation": "Only six years ago, the entire surface of planet Mercury was finally mapped. Detailed observations of the innermost planet's surprising crust began when the robotic have been ongoing since the robotic MESSENGER spacecraft first passed Mercury in 2008 and continued until its controlled crash landing in 2015.  Previously, much of the Mercury's surface was unknown as it is too far for Earth-bound telescopes to see clearly, while the Mariner 10 flybys in the 1970s observed only about half. The featured video is a compilation of thousands of images of Mercury rendered in exaggerated colors to better contrast different surface features. Visible on the rotating world are rays emanating from a northern impact that stretch across much of the planet, while about half-way through the video the light colored Caloris Basin rotates into view, a northern ancient impact feature that filled with lava. Recent analysis of MESSENGER data indicates that Mercury has a solid inner core.   Surf the Universe: Click here to see a randomly selected APOD!",
      "media_type": "video",
      "service_version": "v1",
      "title": "All of Mercury",
      "url": "//www.youtube.com/embed/DmYK479EpQc?vq=hd720&rel=0"
    },
    "status": "success",
    "errorThrown": ""
  },
  {
    "data": {
      "date": "2019-04-29",
      "explanation": "Massive stars, abrasive winds, mountains of dust, and energetic light sculpt one of the largest and most picturesque regions of star formation in the Local Group of Galaxies.  Known as N11, the region is visible on the upper right of many images of its home galaxy, the Milky Way neighbor known as the Large Magellanic Clouds (LMC).  The featured image was taken for scientific purposes by the Hubble Space Telescope and reprocessed for artistry by an amateur to win a Hubble's Hidden Treasures competition.  Although the section imaged above is known as NGC 1763, the entire N11 emission nebula is second in LMC size only to the Tarantula Nebula.  Compact globules of dark dust housing emerging young stars are also visible around the image.  A new study of variable stars in the LMC with Hubble has helped to recalibrate the distance scale of the  observable universe, but resulted in a slightly different scale than found using the pervasive cosmic microwave background.   Astrophysicists: Browse 1,900+ codes in the Astrophysics Source Code Library",
      "hdurl": "https://apod.nasa.gov/apod/image/1904/N11_Hubble_1989.jpg",
      "media_type": "image",
      "service_version": "v1",
      "title": "N11: Star Clouds of the LMC",
      "url": "https://apod.nasa.gov/apod/image/1904/N11_Hubble_960.jpg"
    },
    "status": "success",
    "errorThrown": ""
  },
  {
    "data": {
      "date": "2019-04-30",
      "explanation": "The galaxy was never in danger. For one thing, the Triangulum galaxy (M33), pictured, is much bigger than the tiny grain of rock at the head of the meteor. For another, the galaxy is much farther away -- in this instance 3 million light years as opposed to only about 0.0003 light seconds.  Even so, the meteor's path took it angularly below the galaxy. Also the wind high in Earth's atmosphere blew the meteor's glowing evaporative molecule train away from the galaxy, in angular projection.  Still, the astrophotographer was quite lucky to capture both a meteor and a galaxy in a single exposure -- which was subsequently added to two other images of M33 to bring up the spiral galaxy's colors.  At the end, the meteor was gone in a second, but the galaxy will last billions of years.    Follow APOD on: Instagram, Facebook,  Reddit, or Twitter",
      "hdurl": "https://apod.nasa.gov/apod/image/1904/M33Meteor_Chokshi_2000.jpg",
      "media_type": "image",
      "service_version": "v1",
      "title": "Meteor Misses Galaxy",
      "url": "https://apod.nasa.gov/apod/image/1904/M33Meteor_Chokshi_960.jpg"
    },
    "status": "success",
    "errorThrown": ""
  },
  {
    "data": {
      "date": "2019-05-01",
      "explanation": "To some it looks like a cat's eye. To others, perhaps like a giant cosmic conch shell.  It is actually one of brightest and most highly detailed planetary nebula known, composed of gas expelled in the brief yet glorious phase near the end of life of a Sun-like star. This nebula's dying central star may have produced the outer circular concentric shells by shrugging off outer layers in a series of regular convulsions. The formation of the beautiful, complex-yet-symmetric inner structures, however, is not well understood. The featured image is a composite of a digitally sharpened Hubble Space Telescope image with X-ray light captured by the orbiting Chandra Observatory.  The exquisite floating space statue spans over half a light-year across. Of course, gazing into this Cat's Eye, humanity may well be seeing the fate of our sun, destined to enter its own planetary nebula phase of evolution ... in about 5 billion years.",
      "hdurl": "https://apod.nasa.gov/apod/image/1905/CatsEye_HubblePohl_1278.jpg",
      "media_type": "image",
      "service_version": "v1",
      "title": "The Cat's Eye Nebula in Optical and X-ray",
      "url": "https://apod.nasa.gov/apod/image/1905/CatsEye_HubblePohl_960.jpg"
    },
    "status": "success",
    "errorThrown": ""
  },
  {
    "data": {
      "date": "2019-05-02",
      "explanation": "Orbiting 400 kilometers above Quebec, Canada, planet Earth, the International Space Station Expedition 59 crew captured this snapshot of the broad St. Lawrence River and curiously circular Lake Manicouagan on April 11. Right of center, the ring-shaped lake is a modern reservoir within the eroded remnant of an ancient 100 kilometer diameter impact crater. The ancient crater is very conspicuous from orbit, a visible reminder that Earth is vulnerable to rocks from space. Over 200 million years old, the Manicouagan crater was likely caused by the impact of a rocky body about 5 kilometers in diameter.  Currently, there is no known asteroid with a significant probability of impacting Earth in the next century.  But a fictional scenario to help practice for an asteroid impact is on going at the 2019 IAA Planetary Defense Conference.",
      "hdurl": "https://apod.nasa.gov/apod/image/1905/iss059e019043.jpg",
      "media_type": "image",
      "service_version": "v1",
      "title": "Manicouagan Impact Crater from Space",
      "url": "https://apod.nasa.gov/apod/image/1905/iss059e019043_1024.jpg"
    },
    "status": "success",
    "errorThrown": ""
  },
  {
    "data": {
      "copyright": "Team Ciel Austral",
      "date": "2019-05-03",
      "explanation": "The Large Magellanic Cloud (LMC) is an alluring sight in southern skies. But this deep and detailed telescopic view, over 10 months in the making, goes beyond what is visible to most circumnavigators of planet Earth. Spanning over 5 degrees or 10 full moons, the 4x4 panel mosaic was constructed from 3900 frames with a total of 1,060 hours of exposure time in both broadband and narrowband filters. The narrowband filters are designed to transmit only light emitted by sulfur, hydrogen, and oxygen atoms. Ionized by energetic starlight, the atoms emit their characteristic light as electrons are recaptured and the atoms transition to a lower energy state. As a result, in this image the LMC seems covered with its own clouds of ionized gas surrounding its massive, young stars. Sculpted by the strong stellar winds and ultraviolet radiation, the glowing clouds, dominated by emission from hydrogen, are known as H II (ionized hydrogen) regions. Itself composed of many overlapping H II regions, the Tarantula Nebula is the large star forming region at the left. The largest satellite of our Milky Way Galaxy, the LMC is about 15,000 light-years across and lies a mere 160,000 light-years away toward the constellation Dorado.",
      "hdurl": "https://apod.nasa.gov/apod/image/1905/photo95cielaustral2048.jpg",
      "media_type": "image",
      "service_version": "v1",
      "title": "Clouds of the Large Magellanic Cloud",
      "url": "https://apod.nasa.gov/apod/image/1905/photo95cielaustral1024.jpg"
    },
    "status": "success",
    "errorThrown": ""
  },
  {
    "data": {
      "copyright": "Tunc Tezel",
      "date": "2019-05-04",
      "explanation": "On February 2nd early morning risers saw Saturn near an old Moon low on the eastern horizon. On that date bright planet, sunlit crescent, and faint lunar night side were captured in this predawn skyscape from Bursa, Turkey. Of course the Moon's ashen glow is earthshine, earthlight reflected from the Moon's night side. A description of earthshine, in terms of sunlight reflected by Earth's oceans illuminating the Moon's dark surface, was written over 500 years ago by Leonardo da Vinci. On May 2nd an old Moon also rose in the predawn twilight. On that date its ashen glow shared the sky with Venus, the brilliant morning star. May 2nd also marked the 500th anniversary of Leonardo's death in 1519.",
      "hdurl": "https://apod.nasa.gov/apod/image/1905/20190202tezel.jpg",
      "media_type": "image",
      "service_version": "v1",
      "title": "Saturn and the Da Vinci Glow",
      "url": "https://apod.nasa.gov/apod/image/1905/20190202tezel_1024.jpg"
    },
    "status": "success",
    "errorThrown": ""
  },
  {
    "data": {
      "date": "2019-05-05",
      "explanation": "This is not a solar eclipse. Pictured here is a busy vista of moons and rings taken at Saturn. The large circular object in the center of the image is Titan, the largest moon of Saturn and one of the most intriguing objects in the entire Solar System. The dark spot in the center is the main solid part of the moon.  The bright surrounding ring is atmospheric haze above Titan, gas that is scattering sunlight to a camera operating onboard the robotic Cassini spacecraft. Cutting horizontally across the image are the rings of Saturn, seen nearly edge on.  At the lower right of Titan is Enceladus, a small moon of Saturn. Since the image was taken pointing nearly at the Sun, the surfaces of Titan and Enceladus appear in silhouette, and the rings of Saturn appear similar to a photographic negative. Now if you look really really closely at Enceladus, you can see a hint of icy jets shooting out toward the bottom of the image. It is these jets that inspired future proposals to land on Enceladus, burrow into the ice, and search for signs of extraterrestrial life.",
      "hdurl": "https://apod.nasa.gov/apod/image/1905/TitanBusy_Cassini_1080.jpg",
      "media_type": "image",
      "service_version": "v1",
      "title": "Saturn, Titan, Rings, and Haze",
      "url": "https://apod.nasa.gov/apod/image/1905/TitanBusy_Cassini_1080.jpg"
    },
    "status": "success",
    "errorThrown": ""
  },
  {
    "data": {
      "date": "2019-05-06",
      "explanation": "What would it look like to fly over a spiral galaxy? To help visualize this, astronomers and animators at the Space Telescope Science Institute computed a virtual flyby of the Whirlpool Galaxy (M51) using data and images from the Hubble Space Telescope.  At only 25 million light years distant and fully 50 thousand light years across, the Whirlpool is one of the brightest and most picturesque galaxies on the sky. Visible during the virtual flyby are spiral arms dominated by young blue stars, older lighter-colored stars, dark lanes of dust, and bright red emission nebulae. Many galaxies far in the distance can be seen right through M51.  The visualization should be considered a time-lapse, because otherwise the speed of the virtual camera would need to be very near the speed of light.",
      "media_type": "video",
      "service_version": "v1",
      "title": "Virtual Flyby of the Whirlpool Galaxy",
      "url": "https://www.youtube.com/embed/HBhqr0KkntQ?rel=0"
    },
    "status": "success",
    "errorThrown": ""
  },
  {
    "data": {
      "copyright": "Dieter WillaschAstro-Cabinet",
      "date": "2019-05-07",
      "explanation": "What's happening in the center of the Carina Nebula?  Stars are forming, dying, and leaving an impressive tapestry of dark dusty filaments.  The entire Carina Nebula, cataloged as NGC 3372, spans over 300 light years and lies about 8,500 light-years away in the constellation of Carina. The nebula is composed predominantly of hydrogen gas, which emits the pervasive red glow seen in this highly detailed featured image.  The blue glow in the center is created by a trace amount of glowing oxygen. Young and massive stars located in the nebula's center expel dust when they explode in supernovae.  Eta Carinae, the most energetic star in the nebula's center, was one of the brightest stars in the sky in the 1830s, but then faded dramatically.",
      "hdurl": "https://apod.nasa.gov/apod/image/1905/CarinaWideField_Willasch_2200.jpg",
      "media_type": "image",
      "service_version": "v1",
      "title": "The Great Nebula in Carina",
      "url": "https://apod.nasa.gov/apod/image/1905/CarinaWideField_Willasch_1080.jpg"
    },
    "status": "success",
    "errorThrown": ""
  },
  {
    "data": {
      "date": "2019-05-08",
      "explanation": "What does Jupiter look like up close? Most images of Jupiter are taken from far away, either from Earth or from a great enough distance that nearly half the planet is visible. This shot, though, was composed from images taken relatively close in, where less than half of the planet was visible.  From here, Jupiter still appears spherical but perspective distortion now makes it look more like a marble. Visible on Jupiter's cloud tops are a prominent dark horizontal belt containing a white oval cloud, and a white zone cloud, both of which circle the planet. The Great Red Spot looms on the upper right. The featured image was taken by the robotic Juno spacecraft in February during its 17th close pass of our Solar System's largest planet.  Juno's mission, now extended into 2021, is to study Jupiter in new ways. Juno's data has already enabled discoveries that include Jupiter's magnetic field being surprisingly lumpy, and that some of Jupiter's cloud systems run about 3,000 kilometers into the planet.",
      "hdurl": "https://apod.nasa.gov/apod/image/1905/JupiterMarble_JunoGill_3000.jpg",
      "media_type": "image",
      "service_version": "v1",
      "title": "Jupiter Marble from Juno",
      "url": "https://apod.nasa.gov/apod/image/1905/JupiterMarble_JunoGill_960.jpg"
    },
    "status": "success",
    "errorThrown": ""
  }
]
